doom/.config/doom/config.org
#+TITLE: Jackson's Doom Emacs Config
#+STARTUP: show1level

* Preamble
** Doom
#+begin_src elisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Jacklyn Daumeyer"
      user-mail-address "jacklynnnnnn@proton.me")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
(setq doom-font (font-spec :family "Fantasque Sans Mono" :size 14)
      doom-variable-pitch-font (font-spec :family "Karla" :size 14)
      doom-serif-font (font-spec :family "Roboto Slab"))

  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'catppuccin)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/doc/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type nil)


;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c g k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c g d') to jump to their definition and see how
;; they are implemented.

#+END_SRC
** Better Visual Navigation
#+begin_src elisp
(map!
        :nv "k" #'evil-previous-visual-line
        :nv "j" #'evil-next-visual-line
        )

#+end_src

* Tools
** pdf-mode
I'm used to using [key: Shift+J] and ~Shift+K~ to move the next and previous page respectively so I added them to the pdf mode map.
#+begin_src elisp
(map! :after pdf-view-mode
      :map pdf-view-mode
      :nv "J" #'pdf-view-next-page
      :nv "K" #'pdf-view-previous-page)

#+end_src
* Projectile
Set up project directories.
#+begin_src elisp
(setq projectile-project-search-path '("~/doc/projects/" "~/doc/org/")
      projectile-globally-ignored-file-suffixes '(".pdf" ".odt" ".class" ".vs" ".s" ".o"))
#+end_src

Have projectile open a dired buffer on choosing a project
#+begin_src elisp
(setq projectile-switch-project-action #'projectile-dired)
(setq counsel-projectile-switch-project-action #'counsel-projectile-switch-project-action-dired)
#+end_src

* School
These are just some changes to emacs in order to use it with my schoolwork.
#+begin_src elisp

(setq-default lsp-java-workspace-dir "/home/jed/doc/osu/cse2221/workspace")
(setq lsp-java-java-path "/lib/jvm/java-11-openjdk/bin/java")

(setq org-babel-default-header-args:java
       '((:cmdline . "-cp .:/home/jed/doc/osu/components.jar")
         (:imports . "components.simplewriter.SimpleWriter1L components.simplewriter.SimpleWriter components.simplereader.SimpleReader components.simplereader.SimpleReader1L")))
#+end_src



Setup a latex class for my d&d sessions
#+begin_src elisp

(setq TeX-engine 'luatex)
(with-eval-after-load 'ox-latex
    (add-to-list 'org-latex-classes
                '("dndnotes"
                  "\\documentclass{dndnotes}"
                  ("\\section{%s}" . "\\section*{%s}")
                  ("\\subsection{%s}" . "\\subsection*{%s}")
                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))
    ;; American Psychological Association papers
    (add-to-list 'org-latex-classes
                 '("apa7"
                "\\documentclass[stu, 11pt]{apa7}
                 \\usepackage[nodoi]{apacite}"
                ("\\section{%s}" . "\\section*{%s}")
                ("\\subsection{%s}" . "\\subsection*{%s}")))
    (add-to-list 'org-latex-classes
                '("comm3165"
                  "\\documentclass{comm3165}"
                  ("\\section{%s}" . "\\section*{%s}")
                  ("\\subsection{%s}" . "\\subsection*{%s}")
                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))

)
#+end_src

* Languages
** Org

#+begin_src elisp
(setq plantuml-default-exec-mode 'executable)
#+end_src

#+begin_src elisp
(after! org
#+end_src
*** Babel Lobs
This contains some utilities that I use when writing my notes for school.
#+begin_src elisp
        (org-babel-lob-ingest "/home/jed/.doom.d/babel/notes.org")
#+end_src

#+RESULTS:
: 10

General Utilities for running games of D&D.
#+begin_src elisp
        (org-babel-lob-ingest "/home/jed/.doom.d/babel/dnd.org")
#+end_src

*** Capture
Org-capture is a powerful tool for adding anything in your head to org.
#+begin_src elisp
    (setq org-capture-templates
      '(("i" "Inbox" entry (file "~/doc/org/inbox.org" )
         "* TODO %? \n:PROPERTIES:\n:CREATED: %U\n:END:\n%i\n"
         :kill-buffer t)
        ("n" "Notes" entry (file "~/doc/org/notes.org")
         "* %?\n#+DATE: %U")))
#+end_src

*** Notes
I try to publish all the notes that I take for my courses and publish them to my github. They chan be viewed at [[jdaumeyer.github.com/notes/]].

**** MATH3345 Fundementals of Higher Math
#+begin_src elisp
(setq org-publish-project-alist
          '(
            ;;
            ;; MATH3345 Fundementals of Higher Math
            ;;
            ("math3345-notes"
             :base-directory "~/doc/osu/math3345/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/math3345/"
             :index-fn "directory.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("math3345-static"
             :base-directory "~/doc/osu/math3345/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/math3345/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("math3345" :components ("math3345-notes" "math3345-static"))
#+end_src

**** CSE3231 Software Engineering Techniques
#+begin_src elisp
            ;;
            ;; CSE3231 Software Engineering Techniques
            ;;
            ("cse3231-notes"
             :base-directory "~/doc/osu/cse3231/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/cse3231/"
             :index-fn "index.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("cse3231-static"
             :base-directory "~/doc/osu/cse3231/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/cse3231/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("cse3231" :components ("cse3231-notes" "cse3231-static"))
#+end_src

