doom/.config/doom/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Jacklyn Daumeyer"
      user-mail-address "jacklynnnnnn@proton.me")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
(setq doom-font (font-spec :family "Fantasque Sans Mono" :size 14)
      doom-variable-pitch-font (font-spec :family "Karla" :size 14)
      doom-serif-font (font-spec :family "Roboto Slab"))

  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'catppuccin)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/doc/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type nil)


;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c g k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c g d') to jump to their definition and see how
;; they are implemented.

(map!
        :nv "k" #'evil-previous-visual-line
        :nv "j" #'evil-next-visual-line
        )

(map! :after pdf-tools
      :map pdf-view-mode-map
       "J" #'pdf-view-next-page
      "K" #'pdf-view-previous-page
      "j" #'pdf-view-next-line-or-next-page
      "k" #'pdf-view-previous-line-or-previous-page
      "SPC" #'doom/leader ; I hate having the leader stolen
)

(setq +zen-text-scale 0)

(setq projectile-project-search-path '("~/doc/projects/" "~/doc/org/")
      projectile-globally-ignored-file-suffixes '(".pdf" ".odt" ".class" ".vs" ".s" ".o"))

(setq projectile-switch-project-action #'projectile-dired)
(setq counsel-projectile-switch-project-action #'counsel-projectile-switch-project-action-dired)

(setq-default lsp-java-workspace-dir "/home/jed/doc/osu/cse2221/workspace")
(setq lsp-java-java-path "/lib/jvm/java-11-openjdk/bin/java")

(setq org-babel-default-header-args:java
       '((:cmdline . "-cp .:/home/jed/doc/osu/components.jar")
         (:imports . "components.simplewriter.SimpleWriter1L components.simplewriter.SimpleWriter components.simplereader.SimpleReader components.simplereader.SimpleReader1L")))

(setq TeX-engine 'luatex)
(with-eval-after-load 'ox-latex
    (add-to-list 'org-latex-classes
                '("dndnotes"
                  "\\documentclass{dndnotes}"
                  ("\\section{%s}" . "\\section*{%s}")
                  ("\\subsection{%s}" . "\\subsection*{%s}")
                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))
    ;; American Psychological Association papers
    (add-to-list 'org-latex-classes
                 '("apa7"
                "\\documentclass[stu, 11pt]{apa7}
                 \\usepackage[nodoi]{apacite}"
                ("\\section{%s}" . "\\section*{%s}")
                ("\\subsection{%s}" . "\\subsection*{%s}")))
    (add-to-list 'org-latex-classes
                '("comm3165"
                  "\\documentclass{comm3165}"
                  ("\\section{%s}" . "\\section*{%s}")
                  ("\\subsection{%s}" . "\\subsection*{%s}")
                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))

)

(setq plantuml-default-exec-mode 'executable)

(after! org

(org-babel-lob-ingest "/home/jed/.doom.d/babel/notes.org")

(org-babel-lob-ingest "/home/jed/.doom.d/babel/dnd.org")

(setq org-capture-templates
  '(("i" "Inbox" entry (file "~/doc/org/inbox.org" )
     "* TODO %? \n:PROPERTIES:\n:CREATED: %U\n:END:\n%i\n"
     :kill-buffer t)
    ("n" "Notes" entry (file "~/doc/org/notes.org")
     "* %?\n#+DATE: %U")))

(setq org-publish-project-alist
          '(
            ;;
            ;; MATH3345 Fundementals of Higher Math
            ;;
            ("math3345-notes"
             :base-directory "~/doc/osu/math3345/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/math3345/"
             :index-fn "directory.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("math3345-static"
             :base-directory "~/doc/osu/math3345/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/math3345/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("math3345" :components ("math3345-notes" "math3345-static"))

;;
;; CSE3231 Software Engineering Techniques
;;
("cse3231-notes"
 :base-directory "~/doc/osu/cse3231/notes/"
 :base-extension "org"
 :publishing-directory "~/doc/osu/publicnotes/cse3231/"
 :index-fn "index.org"
 :recursive t
 :publishing-function org-html-publish-to-html
 :headline-levels 5
 :auto-preamble t)
("cse3231-static"
 :base-directory "~/doc/osu/cse3231/notes/"
 :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
 :publishing-directory "~/doc/osu/publicnotes/cse3231/"
 :recursive t
 :publishing-function org-publish-attachment)
("cse3231" :components ("cse3231-notes" "cse3231-static"))

;;
