doom/.config/doom/config.org
**** ECE 2060 Intro to Digital Logic
#+begin_src elisp
            ;;
            ;; ECE 2060 Intro to Digital Logic            ;;
            ;;
            ("ece2060-notes"
             :base-directory "~/doc/osu/ece2060/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/ece2060/"
             :index-fn "directory.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("ece2060-static"
             :base-directory "~/doc/osu/ece2060/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/ece2060/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("ece2060" :components ("ece2060-notes" "ece2060-static"))
#+end_src

**** CSE 2431 Systems 2
#+begin_src elisp
            ;;
            ;; CSE 2431 Systems 2
            ;;
            ("cse2431-notes"
             :base-directory "~/doc/osu/cse2431/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/cse2431/"
             :index-fn "directory.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("cse2431-static"
             :base-directory "~/doc/osu/cse2431/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/cse2431/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("cse2431" :components ("cse2431-notes" "cse2431-static"))
#+end_src

**** COMM 2367 Persuasive Communication
#+begin_src elisp
            ;;
            ;; COMM 2367 Persuasive Communication
            ;;
            ("comm2367-notes"
             :base-directory "~/doc/osu/comm2367/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/comm2367/"
             :index-fn "directory.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("comm2367-static"
             :base-directory "~/doc/osu/comm2367/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/comm2367/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("comm2367" :components ("comm2367-notes" "comm2367-static"))
#+end_src

**** MATH 1152 Calculus 2 :past:
#+begin_src elisp
            ;;
            ;; MATH 1152 Calculus II
            ;;
            ("math1152-notes"
             :base-directory "~/doc/osu/math1152/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/math1152/"
             :index-fn "directory.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("math1152-static"
             :base-directory "~/doc/osu/math1152/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/math1152/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("math1152" :components ("math1152-notes" "math1152-static"))
#+end_src

**** CSE2421 Systems 1 :past:
#+begin_src elisp
            ;;
            ;; CSE 2321 Discrete Structures
            ;;
            ("cse2421-notes"
             :base-directory "~/doc/osu/cse2421/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/cse2421/"
             :index-fn "index.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("cse2421-static"
             :base-directory "~/doc/osu/cse2421/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/cse2421/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("cse2421" :components ("cse2421-notes" "cse2421-static"))

#+end_src

**** CSE 2321 Foundations 1 :past:
#+begin_src elisp
            ;;
            ;; CSE 2321 Discrete Structures
            ;;
            ("cse2321-notes"
             :base-directory "~/doc/osu/past/cse2321/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/cse2321/"
             :index-fn "directory.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("cse2321-static"
             :base-directory "~/doc/osu/past/cse2321/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/cse2321/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("cse2321" :components ("cse2321-notes" "cse2321-static"))

#+end_src

**** CSE 2331 Foundations 2
#+begin_src elisp
            ;;
            ;; CSE 2331 Data Structures & Algorithms
            ;;
            ("cse2331-notes"
             :base-directory "~/doc/osu/cse2331/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/cse2331/"
             :index-fn "directory.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("cse2331-static"
             :base-directory "~/doc/osu/cse2331/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/cse2331/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("cse2331" :components ("cse2331-notes" "cse2331-static"))

#+end_src

**** CSE 2231 Software 2 :past:
#+begin_src elisp
            ;;
            ;; CSE 2231 Software Development and Design
            ;;
            ("cse2231-notes"
             :base-directory "~/doc/osu/cse2231/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/cse2231/"
             :index-fn "directory.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("cse2231-static"
             :base-directory "~/doc/osu/cse2231/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/cse2231/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("cse2231" :components ("cse2231-notes" "cse2231-static"))
#+end_src
**** CSE 2221 Software 1 :past:
#+begin_src elisp
            ;;
            ;; CSE 2221 Software Components
            ;;
            ("cse2221-notes"
             :base-directory "~/doc/osu/past/cse2221/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/cse2221/"
             :index-fn "directory.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("cse2221-static"
             :base-directory "~/doc/osu/past/cse2221/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/cse2221/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("cse2221" :components ("cse2221-notes" "cse2221-static"))
#+end_src

**** MATH 1151 Calculus 1 :past:
#+begin_src elisp
            ;;
            ;; Math 1151
            ;;
            ("math1151-notes"
             :base-directory "~/doc/osu/past/math1151/notes/"
             :base-extension "org"
             :publishing-directory "~/doc/osu/publicnotes/math1151/"
             :index-fn "directory.org"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 5
             :auto-preamble t)
            ("math1151-static"
             :base-directory "~/doc/osu/past/math1151/notes/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "~/doc/osu/publicnotes/math1151/"
             :recursive t
             :publishing-function org-publish-attachment)
            ("math1151" :components ("math1151-notes" "math1151-static"))
#+end_src

