doom/.config/doom/config.el
 :base-directory "~/doc/osu/comm3165/notes/"
 :base-extension "org"
 :publishing-directory "~/doc/osu/publicnotes/comm3165/"
 :index-fn "directory.org"
 :recursive t
 :publishing-function org-html-publish-to-html
 :headline-levels 5
 :auto-preamble t)
("comm3165-static"
 :base-directory "~/doc/osu/comm3165/notes/"
 :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
 :publishing-directory "~/doc/osu/publicnotes/comm3165/"
 :recursive t
 :publishing-function org-publish-attachment)
("comm3165" :components ("comm3165-notes" "comm3165-static"))

;;
;; COMM3545
;;
("comm3545-notes"
 :base-directory "~/doc/osu/comm3545/notes/"
 :base-extension "org"
 :publishing-directory "~/doc/osu/publicnotes/comm3545/"
 :index-fn "index.org"
 :recursive t
 :publishing-function org-html-publish-to-html
 :headline-levels 5
 :auto-preamble t)
("comm3545-static"
 :base-directory "~/doc/osu/comm3545/notes/"
 :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
 :publishing-directory "~/doc/osu/publicnotes/comm3545/"
 :recursive t
 :publishing-function org-publish-attachment)
("comm3545" :components ("comm3545-notes" "comm3545-static"))

;;
  ;; PHYSICS 1250
  ;;
  ("physics1250-notes"
   :base-directory "~/doc/osu/past/physics1250/notes/"
   :base-extension "org"
   :publishing-directory "~/doc/osu/publicnotes/physics1250/"
   :index-fn "directory.org"
   :recursive t
   :publishing-function org-html-publish-to-html
   :headline-levels 5
   :auto-preamble t)
  ("physics1250-static"
   :base-directory "~/doc/osu/past/physics1250/notes/"
   :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
   :publishing-directory "~/doc/osu/publicnotes/physics1250/"
   :recursive t
   :publishing-function org-publish-attachment)
  ("physics1250" :components ("physics1250-notes" "physics1250-static"))

))

(setq org-superstar-headline-bullets-list '("✱" "◉" "●" "○"  "◈" "◇" "➢"  "▣" "□")
      org-ellipsis " ... "
      display-line-numbers-type nil) ;; folding symbol

;; Header Faces
    (set-face-attribute 'org-document-title nil  :weight 'extra-bold)
    (set-face-attribute 'org-level-1        nil  :weight 'extra-bold)
    (set-face-attribute 'org-level-2        nil  :weight 'extra-bold)
    (set-face-attribute 'org-level-3        nil  :weight 'extra-bold)
    (set-face-attribute 'org-level-4        nil  :weight 'extra-bold)
    (set-face-attribute 'org-level-5        nil  :weight 'extra-bold)
    (set-face-attribute 'org-level-6        nil  :weight 'extra-bold)
    (set-face-attribute 'org-level-7        nil  :weight 'extra-bold)
    (set-face-attribute 'org-level-8        nil  :weight 'extra-bold)
    (set-face-attribute 'org-tag            nil :family "Fantasque Sans Mono" :height 1.0)
    ;; Agenda Faces
    (set-face-attribute 'org-agenda-date                  nil :family "Fantasque Sans Mono" :height 1.6)
    (set-face-attribute 'org-agenda-date-today            nil :family "Fantasque Sans Mono" :height 1.6)
    (set-face-attribute 'org-agenda-date-weekend          nil :family "Fantasque Sans Mono" :height 1.6)
    ;;(set-face-attribute 'org-agenda-date-later            nil :family "Roboto Slab" :height 1.5)
    ;;(set-face-attribute 'org-agenda-date-earlier          nil :family "Roboto Slab" :height 1.5)
    (set-face-attribute 'org-agenda-structure             nil :family "Roboto Slab" :height 2.0)
    ;;(set-face-attribute 'org-agenda-deadline-face         nil :foreground "red")
    (setq org-todo-keywords '((sequence "TODO(t)" "PROG(p)" "WAIT(w)" "|" "DONE(d)")))
  ;; ☑□⌚e
        ;; show actually italicized text instead of /italicized text/
  ;; Make lists look a bit cooler
  ;;(font-lock-add-keywords 'org-mode
  ;;                      '(("^+\\([-*]\\) "
  ;;                        (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "➥"))))))
;; ➥ →
    )

(add-hook! org-mode :append
           #'variable-pitch-mode)

(add-hook! org-mode :append
           #'visual-fill-column-mode)

(setq org-agenda-block-separator (string-to-char " "))
(setq org-agenda-format-date 'my-org-agenda-format-date-aligned)

(defun my-org-agenda-format-date-aligned (date)
  "Format a DATE string for display in the daily/weekly agenda, or timeline.
This function makes sure that dates are aligned for easy reading."
  (require 'cal-iso)
  (let* ((dayname (calendar-day-name date 1 nil))
         (day (cadr date))
         (day-of-week (calendar-day-of-week date))
         (month (car date))
         (monthname (calendar-month-name month 1))
         (year (nth 2 date))
         (iso-week (org-days-to-iso-week
                    (calendar-absolute-from-gregorian date)))
         (weekyear (cond ((and (= month 1) (>= iso-week 52))
                          (1- year))
                         ((and (= month 12) (<= iso-week 1))
                          (1+ year))
                         (t year)))
         (weekstring (if (= day-of-week 1)
                         (format " W%02d" iso-week)
                       "")))
         (format " %s %s/%2d  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━\n"
            dayname month day)))

(setq org-agenda-custom-commands
      '(("x" "My Agenda"
          ((agenda "" (;;(org-agenda-skip-scheduled-if-done f)
                      (org-agenda-skip-timestamp-if-done t)
                      (org-agenda-skip-deadline-if-done t)
                      (org-agenda-start-day "+0d")
                      (org-agenda-span 7)
                      (org-agenda-include-diary t)
                      (org-agenda-overriding-header "\n✱ SCHEDULE:\n━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\n")

                      ;;(org-agenda-repeating-timestamp-show-all nil)
                      (org-agenda-prefix-format "     %t ")
                       ;;(concat "  %-3i  %-15b %t%s" org-agenda-hidden-separator))
                      ;;(org-agenda-todo-keyword-format " ☐ ")
                      (org-agenda-time)
                      (org-agenda-current-time-string "⯇━━━━━━━━━ NOW")
                      ;;(org-agenda-scheduled-leaders '("" ""))
                      ;;(org-agenda-deadline-leaders '("" ""))
                      (org-agenda-time-grid (quote ((today require-timed remove-match) (0800 2100) "      " "━━━━━━━━━━━━━━━")))
                      ))

          (alltodo "" ;; List of all other tasks
                ((org-agenda-overriding-header "✱ TASKS:\n━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\n")
                (org-agenda-remove-tags t)
                (org-agenda-skip-deadline t)
                (org-agenda-prefix-format "   %t ")
                ;;(org-agenda-todo-keyword-format "")
                (org-agenda-dim-blocked-tasks 'invisible)
                (org-agenda-skip-function '(org-agenda-skip-entry-if 'scheduled))) ;; Ignore any scheduled tasks
        )))))

(setq org-icalendar-store-UID t)

(setq org-use-property-inheritance t)

;;(map! :map gdb-mi
;;      :leader
;;      :prefix ("d". "debug")
;;
;;      :desc "gdb step"  "s" #'
;;
;;                )
