doom/.config/doom/config.org
** LaTeX
#+begin_src elisp
(setq +latex-viewers '(pdf-tools))
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
#+end_src
** Quandary
#+begin_src elisp
;;(add-to-list 'org-babel-load-languages '(quandary . t))
#+end_src

** Astro
#+begin_src elisp
(use-package! astro-ts-mode
  :after treesit-auto
  :init
  (when (modulep! +lsp)
  (add-hook 'astro-ts-mode-hook #'lsp! 'append))
  :config
  (global-treesit-auto-mode)
  (let ((astro-recipe (make-treesit-auto-recipe
                       :lang 'astro
                       :ts-mode 'astro-ts-mode
                       :url "https://github.com/virchau13/tree-sitter-astro"
                       :revision "master"
                       :source-dir "src")))
    (add-to-list 'treesit-auto-recipe-list astro-recipe)))
#+end_src
* Emacs Server
#+begin_src elisp
(setq window-divider-default-bottom-width 2  ; default is 1
      window-divider-default-right-width  2)  ; default is 1
#+end_src
Start the emacs server. I mainly just use this to open files from other sources in emacs.
#+begin_src elisp
(server-start)
#+end_src
