doom/.config/doom/config.el

(setq +latex-viewers '(pdf-tools))
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

;;(add-to-list 'org-babel-load-languages '(quandary . t))

(use-package! astro-ts-mode
  :after treesit-auto
  :init
  (when (modulep! +lsp)
  (add-hook 'astro-ts-mode-hook #'lsp! 'append))
  :config
  (global-treesit-auto-mode)
  (let ((astro-recipe (make-treesit-auto-recipe
                       :lang 'astro
                       :ts-mode 'astro-ts-mode
                       :url "https://github.com/virchau13/tree-sitter-astro"
                       :revision "master"
                       :source-dir "src")))
    (add-to-list 'treesit-auto-recipe-list astro-recipe)))

(setq window-divider-default-bottom-width 2  ; default is 1
      window-divider-default-right-width  2)  ; default is 1

(server-start)
